from flask import Flask, jsonify

app = Flask(__name__)

russianQuestions = {
    "праздник": "праздник",
    "вместе": "вместе",
    "орех": "орех",
    "овёс": "овёс",
    "восток": "восток",
    "пшеница": "пшеница",
    "заря": "заря",
    "понедельник": "понедельник",
    "погода": "погода",
    "трактор": "трактор",
    "чёрный": "чёрный",
    "четыре": "четыре",
    "восемь": "восемь",
    "вторник": "вторник",
    "среда": "среда",
    "картофель": "картофель",
    "петрушка": "петрушка",
    "овощи": "овощи",
    "горох": "горох",
    "огурец": "огурец",
    "помидор": "помидор",
    "огород": "огород",
    "компьютер": "компьютер",
    "столица": "столица",
    "творог": "творог",
    "обед": "обед",
    "ужин": "ужин",
    "ракета": "ракета",
    "шоссе": "шоссе",
    "пирог": "пирог",
    "четверг": "четверг",
    "север": "север",
    "пороша": "пороша",
    "чувство": "чувство",
    "лестница": "лестница",
    "интересный": "интересный",
    "интересно": "интересно",
    "коллектив": "коллектив",
    "коллекция": "коллекция",
    "аккуратно": "аккуратно",
    "аккуратный": "аккуратный",
    "грамм": "грамм",
    "килограмм": "килограмм",
};

@app.route('/api/words')
def get_words():
    return jsonify(russianQuestions)

if __name__ == '__main__':
    app.run(debug=True)
